<?php

return [
    'admins'            => [
        'create'    => [
            'form'  => [
                'confirm_password'  => 'تاكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                'image'             => 'الصورة الشخصية',
                'info'              => 'البيانات',
                'mobile'            => 'الهاتف',
                'name'              => 'الاسم',
                'password'          => 'كلمة المرور',
                'roles'             => 'الادوار',
            ],
            'title' => 'اضافة المدراء',
        ],
        'datatable' => [
            'created_at'    => 'تاريخ الآنشاء',
            'date_range'    => 'البحث بالتواريخ',
            'email'         => 'البريد الالكتروني',
            'image'         => 'الصورة الشخصية',
            'mobile'        => 'الهاتف',
            'name'          => 'الاسم',
            'options'       => 'الخيارات',
        ],
        'index'     => [
            'title' => 'المدراء',
        ],
        'update'    => [
            'form'  => [
                'confirm_password'  => 'تآكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                'image'             => 'الصورة الشخصية',
                'mobile'            => 'الهاتف',
                'name'              => 'الاسم',
                'password'          => 'تغير كلمة المرور',
                'roles'             => 'الادوار',
            ],
            'title' => 'تعديل المدراء',
        ],
        'validation'=> [
            'email'     => [
                'required'  => 'من فضلك ادخل البريد الالكتروني',
                'unique'    => 'هذا البريد تم ادخالة من قبل',
            ],
            'mobile'    => [
                'digits_between'    => 'من فضلك ادخل ٨ ارقام فقط داخل رقم الهاتف',
                'numeric'           => 'يجب ان يتكون رقم الهاتف من ارقام فقط بالانجليزية',
                'required'          => 'من فضلك ادخل رقم الهاتف',
                'unique'            => 'رقم الهاتف تم ادخالة من قبل',
            ],
            'name'      => [
                'required'  => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password'  => [
                'min'       => 'يجب ان يتكون كلمة المرور من كلمة اكبر من ٦ مدخلات : ارقام او احرف',
                'required'  => 'من فضلك ادخل كلمة المرور',
                'same'      => 'كلمة المرور غير متطابقة مع التآكيد',
            ],
            'roles'     => [
                'required'  => 'من فضلك اختر ادوار المدير',
            ],
        ],
    ],
    'users'             => [
        'form'  => [
            'confirm_password'  => 'تاكيد كلمة المرور',
            'email'             => 'البريد الالكتروني',
            'general'           => 'بيانات عامة',
            'image'             => 'الصورة الشخصية',
            'info'              => 'البيانات',
            'mobile'            => 'الهاتف',
            'name'              => 'الاسم',
            'password'          => 'كلمة المرور',
            "level_id"          => "المستوى",
            "admin_approved"    => "توثيق",
            "is_verified"       => "تاكيد الجوال",
            "send_welcome_email" => 'رسالة ترحيبية',
            "nationality_id"    => "الجنسية",
            "nationality"    => "الجنسية",
            'notes' => 'التعليقات / الملاحظات',
            'status' => 'الحالة',
            'city' => 'المدينة',
            'state' => 'المحافظة',
            'city_id' => 'المدينة',
            'state_id' => 'المحافظة',

        ],
        'create'    => [

            'title' => 'اضافة مكاتب',
        ],
        'datatable' => [
            'created_at'    => 'تاريخ الآنشاء',
            'date_range'    => 'البحث بالتواريخ',
            'email'         => 'البريد الالكتروني',
            'image'         => 'الصورة الشخصية',
            'mobile'        => 'الهاتف',
            "parents"       => "الاب",
            "admin_approved"=> "التوثيق من قبل الاداره",
            "id_number"     => "رقم البطاقة المدنيه",
            'name'          => 'الاسم',
            "level_id"          => "المستوى",
            "nationality"    => "الجنسية",
            'notes' => 'التعليقات / الملاحظات',
            'status' => 'الحالة',
            'city' => 'المدينة',
            'state' => 'المحافظة',
            'options'       => 'الخيارات',
        ],
        'index'     => [
            'title' => 'المكاتب',
        ],
        'update'    => [
            'form'  => [
                'confirm_password'  => 'تآكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                'image'             => 'الصورة الشخصية',
                'mobile'            => 'الهاتف',
                'name'              => 'الاسم',
                'password'          => 'تغير كلمة المرور',
            ],
            'title' => 'تعديل مكتب',
        ],
        'validation'=> [
            'email'     => [
                'required'  => 'من فضلك ادخل البريد الالكتروني',
                'unique'    => 'هذا البريد تم ادخالة من قبل',
            ],
            'mobile'    => [
                'digits_between'    => 'من فضلك ادخل ٨ ارقام فقط داخل رقم الهاتف',
                'numeric'           => 'يجب ان يتكون رقم الهاتف من ارقام فقط بالانجليزية',
                'required'          => 'من فضلك ادخل رقم الهاتف',
                'unique'            => 'رقم الهاتف تم ادخالة من قبل',
            ],
            'name'      => [
                'required'  => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password'  => [
                'min'       => 'يجب ان يتكون كلمة المرور من كلمة اكبر من ٦ مدخلات : ارقام او احرف',
                'required'  => 'من فضلك ادخل كلمة المرور',
                'same'      => 'كلمة المرور غير متطابقة مع التآكيد',
            ],
            'id_number'     => [
                'required'  => 'من فضلك أدخل رقم الهوية الوطنية',
                'unique'    => 'رقم الهوية الوطنية موجود مسبقا',
                'numeric'    => 'رقم الهوية الوطنية يجب أن يكون أرقام فقط',
            ],
        ],
    ]
];
